app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "First one"], ["todo_list_id", 1], ["created_at", "2015-05-07 19:58:21.349800"], ["updated_at", "2015-05-07 19:58:21.349800"]]
---
	def create
		@todo_item = @todo_list.todo_items.create(todo_item_params)

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
---
	def destroy
		@todo_item = @todo_list.todo_items.find(params[:id])
		if @todo_item.destroy

UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2015-05-07 20:42:51.028702"], ["updated_at", "2015-05-07 20:42:51.029355"], ["id", 2]]
---
	def complete
		@todo_item.update_attribute(:completed_at, Time.now)

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 1]]
---
	def set_todo_list
		@todo_list = TodoList.find(params[:todo_list_id])

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 2]]
---
	def set_todo_item
		@todo_item = @todo_list.todo_items.find(params[:id])